app/Controllers/PostTests.php

SELECT *
FROM `posts`
WHERE `posts`.`post_id` = '1'
---
    public function testEntry($test_type = "", $post_id = "")
    {
        if (in_array($test_type, $this->testTypes) && $post_details = $this->postModel->find($post_id)) {

INSERT INTO `tests` (`post_id`, `type`, `test_notif_link`, `test_notif_no`, `test_notif_date`, `notes`) VALUES ('1', 'INTERVIEW', 'https://apsc.nic.in/notif_2023/Notif_explo_Ofcr_29_2022_22052023.pdf', '39PSC/DR-32/1/2022-2023', '2023-05-22', 'Will have four rounds of interview.')
---

        try {
            $this->db->transException(true)->transStart();
            $builder_tests->insert($tests_data);

INSERT INTO `test_dates` (`test_date`, `test_id`) VALUES ('2023-06-07', 8)
---
                    'test_id ' => $test_id
                ];
                $this->db->transStart();
                $builder_tst_dates->insert($data);