app/Controllers/PostsController.php

SELECT *
FROM `departments`
ORDER BY `name` ASC
---
    public function listDeptts()
    {
        $builder = $this->db->table('departments');
        $builder->orderBy('name', 'ASC');
        $query = $builder->get();

SELECT *
FROM `posts`
WHERE `advt_id` = '02/2023'
---
    public function getPostsListByAdvt($advt_seg1 = "", $advt_seg2 = "")
    {
        //construct the advt ID from provided segments
        $advt_id = $advt_seg2 ? $advt_seg1 . '/' . $advt_seg2 : $advt_seg1;

        $advtModel = new AdvtModel();
        //Check if the provided Advt. ID exists
        if ($advt_details = $advtModel->find($advt_id)) {
            $posts_details = $this->postModel->where(formUtil::AdvtIDName(), $advt_id)->findAll();