app/Models/TestsModel.php

    public function existTest(string $type = '', $post_id = ''): array|bool
    {
        $builder = $this->builder();
        $builder->where(['type' => $type, 'post_id' => $post_id]);
        $result_set = $builder->get()->getRowArray();
---
SELECT *
FROM `tests`
WHERE `type` = 'INTERVIEW'
AND `post_id` = '1'